In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [2]:
engine = create_engine('sqlite:///../data/raw/Albrodmar.db')

In [4]:
df_personal = pd.read_sql_query("SELECT * FROM personal_info", engine)

In [5]:
df_personal.describe()

                id   Unnamed: 0
count  2208.000000  2208.000000
mean   5536.576993  1155.500000
std    2569.506695   637.539018
min    1000.000000    52.000000
25%    3372.750000   603.750000
50%    5551.500000  1155.500000
75%    7691.750000  1707.250000
max    9997.000000  2259.000000

In [7]:
df_personal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2208 entries, 0 to 2207
Data columns (total 7 columns):
id            2208 non-null int64
lastName      2208 non-null object
age           2143 non-null object
Unnamed: 0    2208 non-null int64
gender        2195 non-null object
country       2208 non-null object
image         2208 non-null object
dtypes: int64(2), object(5)
memory usage: 120.9+ KB

In [8]:
df_personal.head()

,id,lastName,age,Unnamed: 0,gender,country,image
0,5390,bEZOS,54 years old,52,M,United States,https://specials-images.forbesimg.com/imageser...
1,1675,GATEs,62 years old,53,None,None,https://specials-images.forbesimg.com/imageser...
2,2361,bUFFETT,87 years old,54,None,None,https://specials-images.forbesimg.com/imageser...
3,2340,arnAULT,69 years old,55,None,None,https://specials-images.forbesimg.com/imageser...
4,6891,zucKERBERG,1985,56,None,None,https://specials-images.forbesimg.com/imageser...

In [10]:
len(df_personal)

2208

In [11]:
df_personal.isnull().sum()

id             0
lastName       0
age           65
Unnamed: 0     0
gender        13
country        0
image          0
dtype: int64

In [12]:
df_personal.shape

(2208, 7)

In [13]:
df_personal.dtypes

id             int64
lastName      object
age           object
Unnamed: 0     int64
gender        object
country       object
image         object
dtype: object